/*	Main.cpp  √лавный файл

=====================================================================================
								“ехническое задание:
=====================================================================================
–еализовать класс Complex дл€ работы с комплексными числами.
 омплексное число представл€ютс€ парой действительных чисел (a, b), где
a Ч действительна€ часть, b Ч мнима€ часть.
  –еализовать операции:
	- сложени€ [add]
	- вычитани€ [sub]
	- умножени€ [mul]
	- делени€ [div]
	- сравнени€ [equ]
	- сопр€жени€ [conj]
*/

#include "stdafx.h"
#include "Utils.h"
#include "Complex.h"

HANDLE h;


int main(int argc, char *argv[])
{
	init();
	
	execute();
    cout<<"Демонстрация метода сложение\n";
    cout<<"(2+4j)+(2-7j)= ";
    Rational A,B,C;
    A=Rational(2,4);
    B=Rational(2,-7);
    C=A+B;
    C.Display();
    cout<<"\nДемонстрация метода вычитание\n";
    cout<<"(2+4j)-(2-7j)= ";
    C=A-B;
    C.Display();
    cout<<"\nДемонстрация метода умножение\n";
    cout<<"(2+4j)*(2-7j)= ";
    C=A*B;
    C.Display();
    Rational R,T,Y;
    R=Rational(-2,3);
    T=Rational(7,1);
    cout<<"\nДемонстрация метода деление\n";
    cout<<"(-2+3j)/(7+1j)= ";
    Y=R/T;
    Y.Display();
    cout<<"\nДемонстрация метода сопреженного числа\n";
    cout<<"-2+3j= ";
    Y=R.conj();
    Y.Display();
    cout<<"\nДемонстрация метода сравнение\n";
    cout<<"(-2+3j)==(7+1j)= ";
    if(R==T) 
        cout<<"Коплексные числа равны\n";
    else cout<<"Коплексные числа не равны\n";
    system("pause");
    system("cls");
    cout<<"\n   -------------------------------------------------------\n";
    cout<<"\n\n\n\n\n\n\n\n\n\n\n\n";
    choise();
	
	return 0;
} // main



