/*	Main.cpp  Главный файл

=====================================================================================
								Техническое задание:
=====================================================================================
Реализовать класс Complex для работы с комплексными числами.
Комплексное число представляются парой действительных чисел (a, b), где
a — действительная часть, b — мнимая часть.
  Реализовать операции:
	- сложения [add]
	- вычитания [sub]
	- умножения [mul]
	- деления [div]
	- сравнения [equ]
	- сопряжения [conj]
*/

#include "stdafx.h"
#include "Utils.h"
#include "Complex.h"

HANDLE h;


int main(int argc, char *argv[])
{
	init();
	
	execute();
    cout<<"„емонстрациЯ метода сложение\n";
    cout<<"(2+4j)+(2-7j)= ";
    Rational A,B,C;
    A=Rational(2,4);
    B=Rational(2,-7);
    C=A+B;
    C.Display();
    cout<<"\n„емонстрациЯ метода вычитание\n";
    cout<<"(2+4j)-(2-7j)= ";
    C=A-B;
    C.Display();
    cout<<"\n„емонстрациЯ метода умножение\n";
    cout<<"(2+4j)*(2-7j)= ";
    C=A*B;
    C.Display();
    Rational R,T,Y;
    R=Rational(-2,3);
    T=Rational(7,1);
    cout<<"\n„емонстрациЯ метода деление\n";
    cout<<"(-2+3j)/(7+1j)= ";
    Y=R/T;
    Y.Display();
    cout<<"\n„емонстрациЯ метода сопреженного числа\n";
    cout<<"-2+3j= ";
    Y=R.conj();
    Y.Display();
    cout<<"\n„емонстрациЯ метода сравнение\n";
    cout<<"(-2+3j)==(7+1j)= ";
    if(R==T) 
        cout<<"Љоплексные числа равны\n";
    else cout<<"Љоплексные числа не равны\n";
    system("pause");
    system("cls");
    cout<<"\n   -------------------------------------------------------\n";
    cout<<"\n\n\n\n\n\n\n\n\n\n\n\n";
    choise();
	
	return 0;
} // main



